<?php

use Illuminate\Database\Seeder;

class TestPost extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
    	 // 'content' => '这是我的爱情宣言，这是我的爱情宣言，这是我的爱情宣言，这是我的爱情宣言，这是我的爱情宣言，这是我的爱情宣言，这是我的爱情宣言。',
      //   'gender' => array_rand(array_flip(['男', '女'])),
      //   'contact' => '88901236',
      //   'nickname' => $faker->name,
      //   'bod' => $faker->date($format = 'Y-m-d', $max = 'now'),
      //   'location' => ['辽宁省', '大连市', '中山区'],
      //   'marriage' => '未婚',
      //   'hobby' => '运动,读书',

    	$datas = [
    		[
    			'content' => '不抽烟不喝酒不打麻将三不，没房没车没钱没工作四无，爱老婆爱孩子爱父母爱朋友爱我要征婚的你五爱，不要急，你要是答应我，我就和老婆离。字数就不够',
    			'gender' => '男',
    			'contact' => '私信',
    			'nickname' => '好久不见',
    			'bod' => '1987-10-25',
    			'location' => ['辽宁省', '大连市', '中山区'],
    			'marriage' => '未婚',
    			'hobby' => '旅游,钓鱼,电影',
    		],
    		[
    			'content' => '某女学历层次较高，专业学得很时髦；国际男女研究学院婚姻系感情专业来毕业，先把心中黑马王子找；学历专业要同行，性别物种不重要；有意者速联系：7.34（缺心眼子）就是她的QQ号',
    			'gender' => '女',
    			'contact' => '私信',
    			'nickname' => '温茶',
    			'bod' => '1990-03-11',
    			'location' => ['辽宁省', '大连市', '中山区'],
    			'marriage' => '未婚',
    			'hobby' => '聚会,养花',
    		],
    		[
    			'content' => '高科技质量三包版1992年国产，高170cm，去皮净重68公斤。采用人工智能，各部分零件齐全，运转稳定，经N年运行考验，属信得过产品，手续齐全，无限期包退包换。现因发展需要，诚招志同道合者（仅限女性），共同研制开发第二代，欢迎大家来电洽谈',
    			'gender' => '男',
    			'contact' => '私信',
    			'nickname' => '注定孤独终老',
    			'bod' => '1979-06-22',
    			'location' => ['辽宁省', '大连市', '中山区'],
    			'marriage' => '离异',
    			'hobby' => '投资理财,摄影',
    		],
    		[
    			'content' => '十七十八一枝花，二十七八正当家；三十七八还可以，四十七八豆腐渣；人老珠黄近五十，至今还是没成家；今日想争好帅男，第二之春开鲜花',
    			'gender' => '女',
    			'contact' => '私信',
    			'nickname' => '少几分主动',
    			'bod' => '1982-09-21',
    			'location' => ['辽宁省', '大连市', '中山区'],
    			'marriage' => '未婚',
    			'hobby' => '网购,养宠物',
    		],
    		[
    			'content' => '本人自幼经历坎坷，吃过荒山上的毒蛇，睡过腥臭的护城河，骑着破烂的自行车，高唱响亮的单身情歌。念句阿弥陀佛，祈求一位飘渺女客，坐上我的破车，同唱夫妻之歌',
    			'gender' => '男',
    			'contact' => '私信',
    			'nickname' => '失心疯',
    			'bod' => '1987-01-18',
    			'location' => ['辽宁省', '大连市', '中山区'],
    			'marriage' => '未婚',
    			'hobby' => '汽车,台球',
    		],
    		[
    			'content' => '我有一女儿：25岁温柔大方体贴善良对感情忠一，只想找个真心对她的人，年龄上下即可不论高矮胖瘦漂亮有无钱财与否，只为安慰安慰我心。抱着两个在一起幸福的心态征婚！已经售出概不退换。苍天开眼呀，谁要',
    			'gender' => '女',
    			'contact' => '私信',
    			'nickname' => '北城半夏',
    			'bod' => '1977-11-15',
    			'location' => ['辽宁省', '大连市', '中山区'],
    			'marriage' => '离异',
    			'hobby' => '散步,瑜伽',
    		],
    		[
    			'content' => '本人男，有伺机，有别墅，有保姆，英俊潇洒，征婚要求：凡年满18周岁到22周岁怀揣梦想，不甘寂寞，志向远大，渴望幸福未婚少女均可参加，不限名额，前十名均享受优厚待遇，凡看短信者都可参加',
    			'gender' => '男',
    			'contact' => '私信',
    			'nickname' => '純屬虛構',
    			'bod' => '1988-04-01',
    			'location' => ['辽宁省', '大连市', '中山区'],
    			'marriage' => '未婚',
    			'hobby' => '足球,电影',
    		],
    		[
    			'content' => '温柔善良，慷慨大方，出得了厅堂，入得了厨房，又孝顺，处没有人民币简直就是完美无缺的圣人。想有一个家已经很多年，有意愿的人可以收留',
    			'gender' => '女',
    			'contact' => '私信',
    			'nickname' => '选择悲伤',
    			'bod' => '1987-12-17',
    			'location' => ['辽宁省', '大连市', '中山区'],
    			'marriage' => '未婚',
    			'hobby' => '电影,音乐',
    		],
    		[
    			'content' => '某男，地无一亩，房无一间，包里平时不带钱，开车找不到方向盘，身高不到一米半，小学毕业差三天，肩斜脚又癫，嘴歪又斜眼，龅牙翘上天，鼻涕长长挂前川，只有一个好条件，局长老爸要升官。现征未婚妻一名，不是美女靠边站，不是D罩别现眼，不是乖女离远点。如果有意速报名，时间明天十点前，请早来一会排排队，迟到了哥我恕不接见',
    			'gender' => '男',
    			'contact' => '私信',
    			'nickname' => '狂刀霸世',
    			'bod' => '1974-11-15',
    			'location' => ['辽宁省', '大连市', '中山区'],
    			'marriage' => '离异',
    			'hobby' => '跑步,阅读',
    		],
    		[
    			'content' => '小妹本是一剩女，年龄刚过三十五，前年皆因把业创，一不小心把婚误。现寻男士当伴侣，最好稳重又成熟，只要情投与意合，可将事业人相许',
    			'gender' => '女',
    			'contact' => '私信',
    			'nickname' => '怪咖女青年',
    			'bod' => '1989-05-04',
    			'location' => ['辽宁省', '大连市', '中山区'],
    			'marriage' => '未婚',
    			'hobby' => '绘画,酒吧',
    		],
    		[
    			'content' => '征婚启事：男，大学学历，就差几分；有车，二手单车；有房，集体宿舍；外企工作，肯德基擦桌；觅貌美女青年共结良缘，几年以后',
    			'gender' => '男',
    			'contact' => '私信',
    			'nickname' => '逍遥浪子',
    			'bod' => '1988-11-03',
    			'location' => ['辽宁省', '大连市', '中山区'],
    			'marriage' => '未婚',
    			'hobby' => '羽毛球,自驾游',
    		],
    		[
    			'content' => '某女，年龄24岁，身高1．62米，身材苗条，俏丽漂亮，文雅大方，大学文化，爱好文学，现在某地级行政机关任秘书。欲觅25~27岁，身高1．7米以上，英俊洒脱，性格开朗，文化程度相当，在县级以上行政单位工作的男子为侣。',
    			'gender' => '女',
    			'contact' => '私信',
    			'nickname' => '眉眼如初',
    			'bod' => '1987-10-30',
    			'location' => ['辽宁省', '大连市', '中山区'],
    			'marriage' => '未婚',
    			'hobby' => '养花,宠物',
    		],
    		[
    			'content' => '这些年来我像一只候鸟，张开希望的羽翼，从一座城市到另一座城市。有人说，热爱一座城市是因为城市里有那个人。在遇上你之前，我只能马不停蹄',
    			'gender' => '女',
    			'contact' => '私信',
    			'nickname' => '阑珊',
    			'bod' => '1990-01-22',
    			'location' => ['辽宁省', '大连市', '中山区'],
    			'marriage' => '未婚',
    			'hobby' => '瑜伽,摄影',
    		],
    		[
    			'content' => '有房有车难，大家都平凡，虽然工作没有，钱不够糊口，常露宿街头，爱好打网游，但性格够温柔，爱人总不够，见女孩就上，从不无故放手，和我好吧，咱一定天长地久。',
    			'gender' => '男',
    			'contact' => '私信',
    			'nickname' => '私奔到月球',
    			'bod' => '1984-12-04',
    			'location' => ['辽宁省', '大连市', '中山区'],
    			'marriage' => '离异',
    			'hobby' => '汽车,爬山,钓鱼',
    		],
    	];
    	$count = count($datas);
        $users = factory(\App\User::class, $count)->create();
        $users->each(function($user, $i) use($datas){
        	
        	$user->post()->create($datas[$i]);
        });
    }
}
